In [1]:
import pandas as pd

titanic = pd.read_csv(
    "https://public.opendatasoft.com/explore/dataset/titanic-passengers/download",
    sep=";",
)

In [3]:
titanic_1 = titanic.drop(columns=["name", "ticket", "cabin"])

In [7]:
titanic_1["survived"] = titanic_1["survived"].replace({"Yes": True, "No": False})

In [9]:
titanic["survived_bool"] = titanic_1["survived"].replace({"Yes": True, "No": False})

In [10]:
titanic

,passengerid,survived,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,survived_bool
0,431,Yes,1,"Bjornstrom-Steffansson, Mr. Mauritz Hakan",male,28.0,0,0,110564,26.5500,C52,S,True
1,664,No,3,"Coleff, Mr. Peju",male,36.0,0,0,349210,7.4958,NaN,S,False
2,44,Yes,2,"Laroche, Miss. Simonne Marie Anne Andree",female,3.0,1,2,SC/Paris 2123,41.5792,NaN,C,True
3,347,Yes,2,"Smith, Miss. Marion Elsie",female,40.0,0,0,31418,13.0000,NaN,S,True
4,891,No,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,743,Yes,1,"Ryerson, Miss. Susan Parker ""Suzette""",female,21.0,2,2,PC 17608,262.3750,B57 B59 B63 B66,C,True
887,766,Yes,1,"Hogeboom, Mrs. John C (Anna Andrews)",female,51.0,1,0,13502,77.9583,D11,S,True
888,356,No,3,"Vanden Steen, Mr. Leo Peter",male,28.0,0,0,345783,9.5000,NaN,S,False
889,449,Yes,3,"Baclini, Miss. Marie Catherine",female,5.0,2,1,2666,19.2583,NaN,C,True
890,546,No,1,"Nicholson, Mr. Arthur Ernest",male,64.0,0,0,693,26.0000,NaN,S,False